/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 10992                             :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: yurihana <boj.kr/u/yurihana>                +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/10992                          #+#        #+#      #+#    */
/*   Solved: 2024/10/07 11:35:18 by yurihana      ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>
int main () {
  int n;
  scanf("%d", &n);
  /*
    n - (i - 1) 개 공백
    첫번째 줄은 별 1개
    마지막줄은 n*2-1개 별
    나머지 줄은 별 1개, 공백 i+1개, 별 1개
  */
  for (int i = 0; i < n; i++) {
    for (int j = 1; j < n - i; j++) {
      printf(" ");
    }
    if (i == n-1) {
      for (int j = 0; j < n*2-1; j++) {
        printf("*");
      }
    } else {
      if (i == 0) {
        printf("*");
      } else {
        printf("*");
        for (int j = 0; j < i*2-1; j++) {
          printf(" ");
        }
        printf("*");
      }
    }
    printf("\n");
  }
}